/******************************************************************** PCX.CPP
 *                                                                          *
 *                 PCX/PCC Graphic Import Add-on for Escriba                *
 *                                                                          *
 ****************************************************************************/

#include "System.h"

#include <direct.h>
#include <stdarg.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "External.h"

#include "Debug.h"
#include "Dialog.h"
#include "HelpWin.h"
#include "LModule.h"
#include "Module.h"
#include "ReString.h"

#include "Pcx.h"

// #define DEBUG

/****************************************************************************
 *                                                                          *
 *                       Definitions & Declarations                         *
 *                                                                          *
 ****************************************************************************/

  // Macros & Constants 

#define PROGRAM_NAME    "PCX"
#define LANGUAGE_NAME   "PCX__*.DLL"


  // Type Definitions

typedef struct {                // PCX File Header (128 bytes)
   UCHAR Manufacturer ;         //  0x0A
   UCHAR Version ;              //  0x05
   UCHAR Encoded ;              //  0x01
   UCHAR BitsPerPixel ;         //  0x08
   SHORT xMin ;                 //  Point.x (0)
   SHORT yMin ;                 //  Point.y (0)
   SHORT xMax ;                 //  Point.x + Size.cx (1024)
   SHORT yMax ;                 //  Point.y + Size.cy (768)
   SHORT hRes ;                 //  150
   SHORT vRes ;                 //  150
   UCHAR Palette [16] [3] ;     //  Don't care for 256 color images.
   UCHAR Reserve ;              //  0x04
   UCHAR Planes ;               //  0x01
   SHORT BytesPerLine ;         //
   SHORT PaletteInfo ;          //  0x0001
   UCHAR Filler [58] ;          //  Zeroed.
} PCXHEADER, *PPCXHEADER ;


  // Function Prototypes

extern "C" {
   extern int _CRT_init ( void ) ;
}


  // Globals (private to the library, created by library instance) 

extern char HomePath [_MAX_PATH+1] = { 0 } ;
static class LanguageModule *Library = 0 ;
static HMODULE LibraryHandle = 0 ;

static char ErrorMessage [500] ;


/****************************************************************************
 *                                                                          *
 *                    Log Message (Debugging Function)                      *
 *                                                                          *
 ****************************************************************************/

extern void Log ( char *Message, ... ) {

  /**************************************************************************
